metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
/*
    LEAmDNS.cpp

    License (MIT license):
      Permission is hereby granted, free of charge, to any person obtaining a copy
      of this software and associated documentation files (the "Software"), to deal
      in the Software without restriction, including without limitation the rights
      to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
      copies of the Software, and to permit persons to whom the Software is
      furnished to do so, subject to the following conditions:

      The above copyright notice and this permission notice shall be included in
      all copies or substantial portions of the Software.

      THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
      IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
      FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
      AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
      LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
      OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
      THE SOFTWARE.

*/

#include <Schedule.h>
#include <AddrList.h>

#include "ESP8266mDNS.h"
#include "LEAmDNS_Priv.h"
#include <LwipIntf.h>
#include <lwip/igmp.h>
#include <lwip/prot/dns.h>

// should be defined at build time
#ifndef ARDUINO_BOARD_ID
#define ARDUINO_BOARD_ID "generic"
#endif

namespace esp8266
{

/*
    LEAmDNS
*/
namespace MDNSImplementation
{

    /**
        INTERFACE
    */

    /**
        MDNSResponder::MDNSResponder
    */
    MDNSResponder::MDNSResponder(void) :
        m_pServices(0), m_pUDPContext(0), m_pcHostname(0), m_pServiceQueries(0),
        m_fnServiceTxtCallback(0), m_bLwipCb(false), m_bRestarting(false)
    {
    }

    /*
        MDNSResponder::~MDNSResponder
    */
    MDNSResponder::~MDNSResponder(void)
    {
        _resetProbeStatus(false);
        _releaseServiceQueries();
        _releaseHostname();
        _releaseUDPContext();
        _releaseServices();
    }

    /*
        MDNSResponder::begin

        Set the host domain (for probing) and install WiFi event handlers for
        IP assignment and disconnection management. In both cases, the MDNS responder
        is restarted (reset and restart probe status)
        Finally the responder is (re)started

    */
    bool MDNSResponder::begin(const char* p_pcHostname, const IPAddress& /*p_IPAddress*/,
                              uint32_t /*p_u32TTL*/)
    {
        bool bResult = false;

        if (_setHostname(p_pcHostname))
        {
            bResult = _restart();
        }

        if (bResult && !m_bLwipCb)
        {
            bool bCallback = LwipIntf::statusChangeCB(
                [this](netif*)
                {
                    if (m_bRestarting)
                    {
                        return;
                    }

                    m_bRestarting = true;
                    schedule_function(
                        [this]()
                        {
                            DEBUG_EX_INFO(
                                DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] begin: restarting "
                                                           "after interface status changed\n")););
                            _restart();
                            m_bRestarting = false;
                        });
                });
            DEBUG_EX_ERR(if (!bCallback) {
                DEBUG_OUTPUT.printf_P(
                    PSTR("[MDNSResponder] begin: FAILED LwipIntf::statusChangeCB!\n"));
            });
            m_bLwipCb = bCallback;
        }

        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] begin: FAILED for '%s'!\n"),
                                  (p_pcHostname ?: "-"));
        });

        return bResult;
    }

    /*
        MDNSResponder::close

        Ends the MDNS responder.
        Announced services are unannounced (by multicasting a goodbye message)

    */
    bool MDNSResponder::close(void)
    {
        bool bResult = false;

        if (0 != m_pUDPContext)
        {
            _announce(false, true);
            _resetProbeStatus(false);  // Stop probing
            _releaseServiceQueries();
            _releaseServices();
            _releaseUDPContext();
            _releaseHostname();

            bResult = true;
        }
        else
        {
            DEBUG_EX_INFO(
                DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] close: Ignoring call to close!\n")););
        }
        return bResult;
    }

    /*
        MDNSResponder::end

        Ends the MDNS responder.
        for compatibility with esp32

    */

    bool MDNSResponder::end(void)
    {
        return close();
    }

    /*
        MDNSResponder::setHostname

        Replaces the current hostname and restarts probing.
        For services without own instance name (when the host name was used a instance
        name), the instance names are replaced also (and the probing is restarted).

    */
    bool MDNSResponder::setHostname(const char* p_pcHostname)
    {
        bool bResult = false;

        if (_setHostname(p_pcHostname))
        {
            m_HostProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart;

            // Replace 'auto-set' service names
            bResult = true;
            for (stcMDNSService* pService = m_pServices; ((bResult) && (pService));
                 pService                 = pService->m_pNext)
            {
                if (pService->m_bAutoName)
                {
                    bResult                                      = pService->setName(p_pcHostname);
                    pService->m_ProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart;
                }
            }
        }
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] setHostname: FAILED for '%s'!\n"),
                                  (p_pcHostname ?: "-"));
        });
        return bResult;
    }

