metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MDNSResponder::setHostname (LEGACY)
    */
    bool MDNSResponder::setHostname(const String& p_strHostname)
    {
        return setHostname(p_strHostname.c_str());
    }

    /*
        SERVICES
    */

    /*
        MDNSResponder::addService

        Add service; using hostname if no name is explicitly provided for the service
        The usual '_' underline, which is prepended to service and protocol, eg. _http,
        may be given. If not, it is added automatically.

    */
    MDNSResponder::hMDNSService MDNSResponder::addService(const char* p_pcName,
                                                          const char* p_pcService,
                                                          const char* p_pcProtocol,
                                                          uint16_t    p_u16Port)
    {
        hMDNSService hResult = 0;

        if (((!p_pcName) ||  // NO name OR
             (MDNS_DOMAIN_LABEL_MAXLENGTH >= strlen_P(p_pcName)))
            &&  // Fitting name
            (p_pcService) && (MDNS_SERVICE_NAME_LENGTH >= strlen_P(p_pcService)) && (p_pcProtocol)
            && ((MDNS_SERVICE_PROTOCOL_LENGTH - 1) != strlen_P(p_pcProtocol)) && (p_u16Port))
        {
            if (!_findService((p_pcName ?: m_pcHostname), p_pcService,
                              p_pcProtocol))  // Not already used
            {
                if (0
                    != (hResult = (hMDNSService)_allocService(p_pcName, p_pcService, p_pcProtocol,
                                                              p_u16Port)))
                {
                    // Start probing
                    ((stcMDNSService*)hResult)->m_ProbeInformation.m_ProbingStatus
                        = ProbingStatus_ReadyToStart;
                }
            }
        }  // else: bad arguments
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(
            PSTR("[MDNSResponder] addService: %s to add '%s.%s.%s'!\n"),
            (hResult ? "Succeeded" : "FAILED"), (p_pcName ?: "-"), p_pcService, p_pcProtocol););
        DEBUG_EX_ERR(if (!hResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] addService: FAILED to add '%s.%s.%s'!\n"),
                                  (p_pcName ?: "-"), p_pcService, p_pcProtocol);
        });
        return hResult;
    }

    /*
        MDNSResponder::removeService

        Unanounce a service (by sending a goodbye message) and remove it
        from the MDNS responder

    */
    bool MDNSResponder::removeService(const MDNSResponder::hMDNSService p_hService)
    {
        stcMDNSService* pService = 0;
        bool            bResult  = (((pService = _findService(p_hService)))
                        && (_announceService(*pService, false)) && (_releaseService(pService)));
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] removeService: FAILED!\n"));
        });
        return bResult;
    }

    /*
        MDNSResponder::removeService
    */
    bool MDNSResponder::removeService(const char* p_pcName, const char* p_pcService,
                                      const char* p_pcProtocol)
    {
        return removeService(
            (hMDNSService)_findService((p_pcName ?: m_pcHostname), p_pcService, p_pcProtocol));
    }

    /*
        MDNSResponder::addService (LEGACY)
    */
    bool MDNSResponder::addService(const String& p_strService, const String& p_strProtocol,
                                   uint16_t p_u16Port)
    {
        return (
            0 != addService(m_pcHostname, p_strService.c_str(), p_strProtocol.c_str(), p_u16Port));
    }

    /*
        MDNSResponder::setServiceName
    */
    bool MDNSResponder::setServiceName(const MDNSResponder::hMDNSService p_hService,
                                       const char*                       p_pcInstanceName)
    {
        stcMDNSService* pService = 0;
        bool            bResult
            = (((!p_pcInstanceName) || (MDNS_DOMAIN_LABEL_MAXLENGTH >= strlen_P(p_pcInstanceName)))
               && ((pService = _findService(p_hService))) && (pService->setName(p_pcInstanceName))
               && ((pService->m_ProbeInformation.m_ProbingStatus = ProbingStatus_ReadyToStart)));
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] setServiceName: FAILED for '%s'!\n"),
                                  (p_pcInstanceName ?: "-"));
        });
        return bResult;
    }

    /*
        SERVICE TXT
    */

    /*
        MDNSResponder::addServiceTxt

        Add a static service TXT item ('Key'='Value') to a service.

    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 const char* p_pcValue)
    {
        hMDNSTxt        hTxt     = 0;
        stcMDNSService* pService = _findService(p_hService);
        if (pService)
        {
            hTxt = (hMDNSTxt)_addServiceTxt(pService, p_pcKey, p_pcValue, false);
        }
        DEBUG_EX_ERR(if (!hTxt) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] addServiceTxt: FAILED for '%s=%s'!\n"),
                                  (p_pcKey ?: "-"), (p_pcValue ?: "-"));
        });
        return hTxt;
    }

    /*
        MDNSResponder::addServiceTxt (uint32_t)

        Formats: http://www.cplusplus.com/reference/cstdio/printf/
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 uint32_t p_u32Value)
    {
        char acBuffer[32];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%u"), p_u32Value);

        return addServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addServiceTxt (uint16_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 uint16_t p_u16Value)
    {
        char acBuffer[16];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hu"), p_u16Value);

        return addServiceTxt(p_hService, p_pcKey, acBuffer);
    }

