metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MDNSResponder::addServiceTxt (uint8_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 uint8_t p_u8Value)
    {
        char acBuffer[8];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hhu"), p_u8Value);

        return addServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addServiceTxt (int32_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 int32_t p_i32Value)
    {
        char acBuffer[32];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%i"), p_i32Value);

        return addServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addServiceTxt (int16_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 int16_t p_i16Value)
    {
        char acBuffer[16];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hi"), p_i16Value);

        return addServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addServiceTxt (int8_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addServiceTxt(const MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                 int8_t p_i8Value)
    {
        char acBuffer[8];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hhi"), p_i8Value);

        return addServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::removeServiceTxt

        Remove a static service TXT item from a service.
    */
    bool MDNSResponder::removeServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                         const MDNSResponder::hMDNSTxt     p_hTxt)
    {
        bool bResult = false;

        stcMDNSService* pService = _findService(p_hService);
        if (pService)
        {
            stcMDNSServiceTxt* pTxt = _findServiceTxt(pService, p_hTxt);
            if (pTxt)
            {
                bResult = _releaseServiceTxt(pService, pTxt);
            }
        }
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] removeServiceTxt: FAILED!\n"));
        });
        return bResult;
    }

    /*
        MDNSResponder::removeServiceTxt
    */
    bool MDNSResponder::removeServiceTxt(const MDNSResponder::hMDNSService p_hService,
                                         const char*                       p_pcKey)
    {
        bool bResult = false;

        stcMDNSService* pService = _findService(p_hService);
        if (pService)
        {
            stcMDNSServiceTxt* pTxt = _findServiceTxt(pService, p_pcKey);
            if (pTxt)
            {
                bResult = _releaseServiceTxt(pService, pTxt);
            }
        }
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] removeServiceTxt: FAILED for '%s'!\n"),
                                  (p_pcKey ?: "-"));
        });
        return bResult;
    }

    /*
        MDNSResponder::removeServiceTxt
    */
    bool MDNSResponder::removeServiceTxt(const char* p_pcName, const char* p_pcService,
                                         const char* p_pcProtocol, const char* p_pcKey)
    {
        bool bResult = false;

        stcMDNSService* pService
            = _findService((p_pcName ?: m_pcHostname), p_pcService, p_pcProtocol);
        if (pService)
        {
            stcMDNSServiceTxt* pTxt = _findServiceTxt(pService, p_pcKey);
            if (pTxt)
            {
                bResult = _releaseServiceTxt(pService, pTxt);
            }
        }
        return bResult;
    }

    /*
        MDNSResponder::addServiceTxt (LEGACY)
    */
    bool MDNSResponder::addServiceTxt(const char* p_pcService, const char* p_pcProtocol,
                                      const char* p_pcKey, const char* p_pcValue)
    {
        return (0
                != _addServiceTxt(_findService(m_pcHostname, p_pcService, p_pcProtocol), p_pcKey,
                                  p_pcValue, false));
    }

    /*
        MDNSResponder::addServiceTxt (LEGACY)
    */
    bool MDNSResponder::addServiceTxt(const String& p_strService, const String& p_strProtocol,
                                      const String& p_strKey, const String& p_strValue)
    {
        return (0
                != _addServiceTxt(
                    _findService(m_pcHostname, p_strService.c_str(), p_strProtocol.c_str()),
                    p_strKey.c_str(), p_strValue.c_str(), false));
    }

    /*
        MDNSResponder::setDynamicServiceTxtCallback (global)

        Set a global callback for dynamic service TXT items. The callback is called, whenever
        service TXT items are needed.

    */
    bool MDNSResponder::setDynamicServiceTxtCallback(
        MDNSResponder::MDNSDynamicServiceTxtCallbackFunc p_fnCallback)
    {
        m_fnServiceTxtCallback = p_fnCallback;

        return true;
    }

    /*
        MDNSResponder::setDynamicServiceTxtCallback (service specific)

        Set a service specific callback for dynamic service TXT items. The callback is called,
       whenever service TXT items are needed for the given service.

    */
    bool MDNSResponder::setDynamicServiceTxtCallback(
        MDNSResponder::hMDNSService                      p_hService,
        MDNSResponder::MDNSDynamicServiceTxtCallbackFunc p_fnCallback)
    {
        bool bResult = false;

        stcMDNSService* pService = _findService(p_hService);
        if (pService)
        {
            pService->m_fnTxtCallback = p_fnCallback;

            bResult = true;
        }
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] setDynamicServiceTxtCallback: FAILED!\n"));
        });
        return bResult;
    }

