metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MDNSResponder::addDynamicServiceTxt
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        const char* p_pcValue)
    {
        // DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] addDynamicServiceTxt
        // (%s=%s)\n"), p_pcKey, p_pcValue););

        hMDNSTxt hTxt = 0;

        stcMDNSService* pService = _findService(p_hService);
        if (pService)
        {
            hTxt = _addServiceTxt(pService, p_pcKey, p_pcValue, true);
        }
        DEBUG_EX_ERR(if (!hTxt) {
            DEBUG_OUTPUT.printf_P(
                PSTR("[MDNSResponder] addDynamicServiceTxt: FAILED for '%s=%s'!\n"),
                (p_pcKey ?: "-"), (p_pcValue ?: "-"));
        });
        return hTxt;
    }

    /*
        MDNSResponder::addDynamicServiceTxt (uint32_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        uint32_t p_u32Value)
    {
        char acBuffer[32];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%u"), p_u32Value);

        return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addDynamicServiceTxt (uint16_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        uint16_t p_u16Value)
    {
        char acBuffer[16];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hu"), p_u16Value);

        return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addDynamicServiceTxt (uint8_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        uint8_t p_u8Value)
    {
        char acBuffer[8];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hhu"), p_u8Value);

        return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addDynamicServiceTxt (int32_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        int32_t p_i32Value)
    {
        char acBuffer[32];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%i"), p_i32Value);

        return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addDynamicServiceTxt (int16_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        int16_t p_i16Value)
    {
        char acBuffer[16];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hi"), p_i16Value);

        return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /*
        MDNSResponder::addDynamicServiceTxt (int8_t)
    */
    MDNSResponder::hMDNSTxt
    MDNSResponder::addDynamicServiceTxt(MDNSResponder::hMDNSService p_hService, const char* p_pcKey,
                                        int8_t p_i8Value)
    {
        char acBuffer[8];
        *acBuffer = 0;
        sprintf_P(acBuffer, PSTR("%hhi"), p_i8Value);

        return addDynamicServiceTxt(p_hService, p_pcKey, acBuffer);
    }

    /**
        STATIC SERVICE QUERY (LEGACY)
    */

    /*
        MDNSResponder::queryService

        Perform a (blocking) static service query.
        The arrived answers can be queried by calling:
        - answerHostname (or 'hostname')
        - answerIP (or 'IP')
        - answerPort (or 'port')

    */
    uint32_t
    MDNSResponder::queryService(const char* p_pcService, const char* p_pcProtocol,
                                const uint16_t p_u16Timeout /*= MDNS_QUERYSERVICES_WAIT_TIME*/)
    {
        if (0 == m_pUDPContext)
        {
            // safeguard against misuse
            return 0;
        }

        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] queryService '%s.%s'\n"),
                                            p_pcService, p_pcProtocol););

        uint32_t u32Result = 0;

        stcMDNSServiceQuery* pServiceQuery = 0;
        if ((p_pcService) && (strlen_P(p_pcService)) && (p_pcProtocol) && (strlen_P(p_pcProtocol))
            && (p_u16Timeout) && (_removeLegacyServiceQuery())
            && ((pServiceQuery = _allocServiceQuery()))
            && (_buildDomainForService(p_pcService, p_pcProtocol,
                                       pServiceQuery->m_ServiceTypeDomain)))
        {
            pServiceQuery->m_bLegacyQuery = true;

            if (_sendMDNSServiceQuery(*pServiceQuery))
            {
                // Wait for answers to arrive
                DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(
                    PSTR("[MDNSResponder] queryService: Waiting %u ms for answers...\n"),
                    p_u16Timeout););
                delay(p_u16Timeout);

                // All answers should have arrived by now -> stop adding new answers
                pServiceQuery->m_bAwaitingAnswers = false;
                u32Result                         = pServiceQuery->answerCount();
            }
            else  // FAILED to send query
            {
                _removeServiceQuery(pServiceQuery);
            }
        }
        else
        {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(
                PSTR("[MDNSResponder] queryService: INVALID input data!\n")););
        }
        return u32Result;
    }

    /*
        MDNSResponder::removeQuery

        Remove the last static service query (and all answers).

    */
    bool MDNSResponder::removeQuery(void)
    {
        return _removeLegacyServiceQuery();
    }

    /*
        MDNSResponder::queryService (LEGACY)
    */
    uint32_t MDNSResponder::queryService(const String& p_strService, const String& p_strProtocol)
    {
        return queryService(p_strService.c_str(), p_strProtocol.c_str());
    }

