metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MDNSResponder::answerHostname
    */
    const char* MDNSResponder::answerHostname(const uint32_t p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findLegacyServiceQuery();
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);

        if ((pSQAnswer) && (pSQAnswer->m_HostDomain.m_u16NameLength)
            && (!pSQAnswer->m_pcHostDomain))
        {
            char* pcHostDomain = pSQAnswer->allocHostDomain(pSQAnswer->m_HostDomain.c_strLength());
            if (pcHostDomain)
            {
                pSQAnswer->m_HostDomain.c_str(pcHostDomain);
            }
        }
        return (pSQAnswer ? pSQAnswer->m_pcHostDomain : 0);
    }

#ifdef MDNS_IP4_SUPPORT
    /*
        MDNSResponder::answerIP
    */
    IPAddress MDNSResponder::answerIP(const uint32_t p_u32AnswerIndex)
    {
        const stcMDNSServiceQuery*            pServiceQuery = _findLegacyServiceQuery();
        const stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        const stcMDNSServiceQuery::stcAnswer::stcIP4Address* pIP4Address
            = (((pSQAnswer) && (pSQAnswer->m_pIP4Addresses)) ? pSQAnswer->IP4AddressAtIndex(0) : 0);
        return (pIP4Address ? pIP4Address->m_IPAddress : IPAddress());
    }
#endif

#ifdef MDNS_IP6_SUPPORT
    /*
        MDNSResponder::answerIP6
    */
    IPAddress MDNSResponder::answerIP6(const uint32_t p_u32AnswerIndex)
    {
        const stcMDNSServiceQuery*            pServiceQuery = _findLegacyServiceQuery();
        const stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        const stcMDNSServiceQuery::stcAnswer::stcIP6Address* pIP6Address
            = (((pSQAnswer) && (pSQAnswer->m_pIP6Addresses)) ? pSQAnswer->IP6AddressAtIndex(0) : 0);
        return (pIP6Address ? pIP6Address->m_IPAddress : IP6Address());
    }
#endif

    /*
        MDNSResponder::answerPort
    */
    uint16_t MDNSResponder::answerPort(const uint32_t p_u32AnswerIndex)
    {
        const stcMDNSServiceQuery*            pServiceQuery = _findLegacyServiceQuery();
        const stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return (pSQAnswer ? pSQAnswer->m_u16Port : 0);
    }

    /*
        MDNSResponder::hostname (LEGACY)
    */
    String MDNSResponder::hostname(const uint32_t p_u32AnswerIndex)
    {
        return String(answerHostname(p_u32AnswerIndex));
    }

    /*
        MDNSResponder::IP (LEGACY)
    */
    IPAddress MDNSResponder::IP(const uint32_t p_u32AnswerIndex)
    {
        return answerIP(p_u32AnswerIndex);
    }

    /*
        MDNSResponder::port (LEGACY)
    */
    uint16_t MDNSResponder::port(const uint32_t p_u32AnswerIndex)
    {
        return answerPort(p_u32AnswerIndex);
    }

    /**
        DYNAMIC SERVICE QUERY
    */

    /*
        MDNSResponder::installServiceQuery

        Add a dynamic service query and a corresponding callback to the MDNS responder.
        The callback will be called for every answer update.
        The answers can also be queried by calling:
        - answerServiceDomain
        - answerHostDomain
        - answerIP4Address/answerIP6Address
        - answerPort
        - answerTxts

    */
    MDNSResponder::hMDNSServiceQuery
    MDNSResponder::installServiceQuery(const char* p_pcService, const char* p_pcProtocol,
                                       MDNSResponder::MDNSServiceQueryCallbackFunc p_fnCallback)
    {
        hMDNSServiceQuery hResult = 0;

        stcMDNSServiceQuery* pServiceQuery = 0;
        if ((p_pcService) && (strlen_P(p_pcService)) && (p_pcProtocol) && (strlen_P(p_pcProtocol))
            && (p_fnCallback) && ((pServiceQuery = _allocServiceQuery()))
            && (_buildDomainForService(p_pcService, p_pcProtocol,
                                       pServiceQuery->m_ServiceTypeDomain)))
        {
            pServiceQuery->m_fnCallback   = p_fnCallback;
            pServiceQuery->m_bLegacyQuery = false;

            if (_sendMDNSServiceQuery(*pServiceQuery))
            {
                pServiceQuery->m_u8SentCount = 1;
                pServiceQuery->m_ResendTimeout.reset(MDNS_DYNAMIC_QUERY_RESEND_DELAY);

                hResult = (hMDNSServiceQuery)pServiceQuery;
            }
            else
            {
                _removeServiceQuery(pServiceQuery);
            }
        }
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(
            PSTR("[MDNSResponder] installServiceQuery: %s for '%s.%s'!\n\n"),
            (hResult ? "Succeeded" : "FAILED"), (p_pcService ?: "-"), (p_pcProtocol ?: "-")););
        DEBUG_EX_ERR(if (!hResult) {
            DEBUG_OUTPUT.printf_P(
                PSTR("[MDNSResponder] installServiceQuery: FAILED for '%s.%s'!\n\n"),
                (p_pcService ?: "-"), (p_pcProtocol ?: "-"));
        });
        return hResult;
    }

    /*
        MDNSResponder::removeServiceQuery

        Remove a dynamic service query (and all collected answers) from the MDNS responder

    */
    bool MDNSResponder::removeServiceQuery(MDNSResponder::hMDNSServiceQuery p_hServiceQuery)
    {
        stcMDNSServiceQuery* pServiceQuery = 0;
        bool                 bResult       = (((pServiceQuery = _findServiceQuery(p_hServiceQuery)))
                        && (_removeServiceQuery(pServiceQuery)));
        DEBUG_EX_ERR(if (!bResult) {
            DEBUG_OUTPUT.printf_P(PSTR("[MDNSResponder] removeServiceQuery: FAILED!\n"));
        });
        return bResult;
    }

    /*
        MDNSResponder::answerCount
    */
    uint32_t MDNSResponder::answerCount(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery)
    {
        stcMDNSServiceQuery* pServiceQuery = _findServiceQuery(p_hServiceQuery);
        return (pServiceQuery ? pServiceQuery->answerCount() : 0);
    }

    std::vector<MDNSResponder::MDNSServiceInfo>
    MDNSResponder::answerInfo(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery)
    {
        std::vector<MDNSResponder::MDNSServiceInfo> tempVector;
        for (uint32_t i = 0; i < answerCount(p_hServiceQuery); i++)
        {
            tempVector.emplace_back(*this, p_hServiceQuery, i);
        }
        return tempVector;
    }

