metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MDNSResponder::answerServiceDomain

        Returns the domain for the given service.
        If not already existing, the string is allocated, filled and attached to the answer.

    */
    const char*
    MDNSResponder::answerServiceDomain(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                       const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        // Fill m_pcServiceDomain (if not already done)
        if ((pSQAnswer) && (pSQAnswer->m_ServiceDomain.m_u16NameLength)
            && (!pSQAnswer->m_pcServiceDomain))
        {
            pSQAnswer->m_pcServiceDomain
                = pSQAnswer->allocServiceDomain(pSQAnswer->m_ServiceDomain.c_strLength());
            if (pSQAnswer->m_pcServiceDomain)
            {
                pSQAnswer->m_ServiceDomain.c_str(pSQAnswer->m_pcServiceDomain);
            }
        }
        return (pSQAnswer ? pSQAnswer->m_pcServiceDomain : 0);
    }

    /*
        MDNSResponder::hasAnswerHostDomain
    */
    bool MDNSResponder::hasAnswerHostDomain(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                            const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer)
                && (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_HostDomainAndPort));
    }

    /*
        MDNSResponder::answerHostDomain

        Returns the host domain for the given service.
        If not already existing, the string is allocated, filled and attached to the answer.

    */
    const char*
    MDNSResponder::answerHostDomain(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                    const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        // Fill m_pcHostDomain (if not already done)
        if ((pSQAnswer) && (pSQAnswer->m_HostDomain.m_u16NameLength)
            && (!pSQAnswer->m_pcHostDomain))
        {
            pSQAnswer->m_pcHostDomain
                = pSQAnswer->allocHostDomain(pSQAnswer->m_HostDomain.c_strLength());
            if (pSQAnswer->m_pcHostDomain)
            {
                pSQAnswer->m_HostDomain.c_str(pSQAnswer->m_pcHostDomain);
            }
        }
        return (pSQAnswer ? pSQAnswer->m_pcHostDomain : 0);
    }

#ifdef MDNS_IP4_SUPPORT
    /*
        MDNSResponder::hasAnswerIP4Address
    */
    bool MDNSResponder::hasAnswerIP4Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                            const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer) && (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_IP4Address));
    }

    /*
        MDNSResponder::answerIP4AddressCount
    */
    uint32_t
    MDNSResponder::answerIP4AddressCount(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                         const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return (pSQAnswer ? pSQAnswer->IP4AddressCount() : 0);
    }

    /*
        MDNSResponder::answerIP4Address
    */
    IPAddress
    MDNSResponder::answerIP4Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                    const uint32_t                         p_u32AnswerIndex,
                                    const uint32_t                         p_u32AddressIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        stcMDNSServiceQuery::stcAnswer::stcIP4Address* pIP4Address
            = (pSQAnswer ? pSQAnswer->IP4AddressAtIndex(p_u32AddressIndex) : 0);
        return (pIP4Address ? pIP4Address->m_IPAddress : IPAddress());
    }
#endif

#ifdef MDNS_IP6_SUPPORT
    /*
        MDNSResponder::hasAnswerIP6Address
    */
    bool MDNSResponder::hasAnswerIP6Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                            const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer)
                && (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_HostIP6Address));
    }

    /*
        MDNSResponder::answerIP6AddressCount
    */
    uint32_t
    MDNSResponder::answerIP6AddressCount(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                         const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return (pSQAnswer ? pSQAnswer->IP6AddressCount() : 0);
    }

