metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MDNSResponder::answerIP6Address
    */
    IPAddress
    MDNSResponder::answerIP6Address(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                    const uint32_t                         p_u32AnswerIndex,
                                    const uint32_t                         p_u32AddressIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        stcMDNSServiceQuery::stcAnswer::stcIP6Address* pIP6Address
            = (pSQAnswer ? pSQAnswer->IP6AddressAtIndex(p_u32AddressIndex) : 0);
        return (pIP6Address ? pIP6Address->m_IPAddress : IPAddress());
    }
#endif

    /*
        MDNSResponder::hasAnswerPort
    */
    bool MDNSResponder::hasAnswerPort(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                      const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer)
                && (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_HostDomainAndPort));
    }

    /*
        MDNSResponder::answerPort
    */
    uint16_t MDNSResponder::answerPort(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                       const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return (pSQAnswer ? pSQAnswer->m_u16Port : 0);
    }

    /*
        MDNSResponder::hasAnswerTxts
    */
    bool MDNSResponder::hasAnswerTxts(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                      const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        return ((pSQAnswer) && (pSQAnswer->m_u32ContentFlags & ServiceQueryAnswerType_Txts));
    }

    /*
        MDNSResponder::answerTxts

        Returns all TXT items for the given service as a ';'-separated string.
        If not already existing; the string is allocated, filled and attached to the answer.

    */
    const char* MDNSResponder::answerTxts(const MDNSResponder::hMDNSServiceQuery p_hServiceQuery,
                                          const uint32_t                         p_u32AnswerIndex)
    {
        stcMDNSServiceQuery*            pServiceQuery = _findServiceQuery(p_hServiceQuery);
        stcMDNSServiceQuery::stcAnswer* pSQAnswer
            = (pServiceQuery ? pServiceQuery->answerAtIndex(p_u32AnswerIndex) : 0);
        // Fill m_pcTxts (if not already done)
        if ((pSQAnswer) && (pSQAnswer->m_Txts.m_pTxts) && (!pSQAnswer->m_pcTxts))
        {
            pSQAnswer->m_pcTxts = pSQAnswer->allocTxts(pSQAnswer->m_Txts.c_strLength());
            if (pSQAnswer->m_pcTxts)
            {
                pSQAnswer->m_Txts.c_str(pSQAnswer->m_pcTxts);
            }
        }
        return (pSQAnswer ? pSQAnswer->m_pcTxts : 0);
    }

    /*
        PROBING
    */

    /*
        MDNSResponder::setProbeResultCallback

        Set a global callback for probe results. The callback is called, when probing
        for the host domain (or a service domain, without specific probe result callback)
        fails or succeeds.
        In the case of failure, the domain name should be changed via 'setHostname' or
       'setServiceName'. When succeeded, the host or service domain will be announced by the MDNS
       responder.

    */
    bool MDNSResponder::setHostProbeResultCallback(MDNSResponder::MDNSHostProbeFn p_fnCallback)
    {
        m_HostProbeInformation.m_fnHostProbeResultCallback = p_fnCallback;

        return true;
    }

    bool MDNSResponder::setHostProbeResultCallback(MDNSHostProbeFn1 pfn)
    {
        using namespace std::placeholders;
        return setHostProbeResultCallback(
            [this, pfn](const char* p_pcDomainName, bool p_bProbeResult)
            {
                pfn(*this, p_pcDomainName, p_bProbeResult);
            });
    }

    /*
        MDNSResponder::setServiceProbeResultCallback

        Set a service specific callback for probe results. The callback is called, when probing
        for the service domain fails or succeeds.
        In the case of failure, the service name should be changed via 'setServiceName'.
        When succeeded, the service domain will be announced by the MDNS responder.

    */
    bool
    MDNSResponder::setServiceProbeResultCallback(const MDNSResponder::hMDNSService p_hService,
                                                 MDNSResponder::MDNSServiceProbeFn p_fnCallback)
    {
        bool bResult = false;

        stcMDNSService* pService = _findService(p_hService);
        if (pService)
        {
            pService->m_ProbeInformation.m_fnServiceProbeResultCallback = p_fnCallback;

            bResult = true;
        }
        return bResult;
    }

    bool
    MDNSResponder::setServiceProbeResultCallback(const MDNSResponder::hMDNSService  p_hService,
                                                 MDNSResponder::MDNSServiceProbeFn1 p_fnCallback)
    {
        using namespace std::placeholders;
        return setServiceProbeResultCallback(
            p_hService,
            [this, p_fnCallback](const char* p_pcServiceName, const hMDNSService p_hMDNSService,
                                 bool p_bProbeResult)
            {
                p_fnCallback(*this, p_pcServiceName, p_hMDNSService, p_bProbeResult);
            });
    }

