metarutaiga/ESP8266-Arduino/libraries/ESP8266mDNS/src/LEAmDNS.cpp
    /*
        MISC
    */

    /*
        MDNSResponder::notifyAPChange

        Should be called, whenever the AP for the MDNS responder changes.
        A bit of this is caught by the event callbacks installed in the constructor.

    */
    bool MDNSResponder::notifyAPChange(void)
    {
        return _restart();
    }

    /*
        MDNSResponder::update

        Should be called in every 'loop'.

    */
    bool MDNSResponder::update(void)
    {
        return _process(true);
    }

    /*
        MDNSResponder::announce

        Should be called, if the 'configuration' changes. Mainly this will be changes in the TXT
       items...
    */
    bool MDNSResponder::announce(void)
    {
        return (_announce(true, true));
    }

    /*
        MDNSResponder::enableArduino

        Enable the OTA update service.

    */
    MDNSResponder::hMDNSService MDNSResponder::enableArduino(uint16_t p_u16Port,
                                                             bool     p_bAuthUpload /*= false*/)
    {
        hMDNSService hService = addService(0, PSTR("arduino"), PSTR("tcp"), p_u16Port);
        if (hService)
        {
            if ((!addServiceTxt(hService, PSTR("tcp_check"), PSTR("no")))
                || (!addServiceTxt(hService, PSTR("ssh_upload"), PSTR("no")))
                || (!addServiceTxt(hService, PSTR("board"), PSTR(ARDUINO_BOARD_ID)))
                || (!addServiceTxt(hService, PSTR("auth_upload"), (p_bAuthUpload) ? PSTR("yes") : PSTR("no"))))
            {
                removeService(hService);
                hService = 0;
            }
        }
        return hService;
    }

    /*

        MULTICAST GROUPS

    */

    /*
        MDNSResponder::_joinMulticastGroups
    */
    bool MDNSResponder::_joinMulticastGroups(void)
    {
        bool bResult = false;

        // Join multicast group(s)
        for (netif* pNetIf = netif_list; pNetIf; pNetIf = pNetIf->next)
        {
            if (netif_is_up(pNetIf) && IPAddress(pNetIf->ip_addr).isSet())
            {
#ifdef MDNS_IP4_SUPPORT
                ip_addr_t multicast_addr_V4 = DNS_MQUERY_IPV4_GROUP_INIT;
                if (!(pNetIf->flags & NETIF_FLAG_IGMP))
                {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR(
                        "[MDNSResponder] _createHost: Setting flag: flags & NETIF_FLAG_IGMP\n")););
                    pNetIf->flags |= NETIF_FLAG_IGMP;

                    if (ERR_OK != igmp_start(pNetIf))
                    {
                        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(
                            PSTR("[MDNSResponder] _createHost: igmp_start FAILED!\n")););
                    }
                }

                if ((ERR_OK == igmp_joingroup_netif(pNetIf, ip_2_ip4(&multicast_addr_V4))))
                {
                    bResult = true;
                }
                else
                {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(
                        PSTR("[MDNSResponder] _createHost: igmp_joingroup_netif(" NETIFID_STR
                             ": %s) FAILED!\n"),
                        NETIFID_VAL(pNetIf), IPAddress(multicast_addr_V4).toString().c_str()););
                }
#endif

#ifdef MDNS_IPV6_SUPPORT
                ip_addr_t multicast_addr_V6 = DNS_MQUERY_IPV6_GROUP_INIT;
                bResult
                    = ((bResult)
                       && (ERR_OK == mld6_joingroup_netif(pNetIf, ip_2_ip6(&multicast_addr_V6))));
                DEBUG_EX_ERR_IF(
                    !bResult,
                    DEBUG_OUTPUT.printf_P(
                        PSTR("[MDNSResponder] _createHost: mld6_joingroup_netif (" NETIFID_STR
                             ") FAILED!\n"),
                        NETIFID_VAL(pNetIf)));
#endif
            }
        }
        return bResult;
    }

    /*
        clsLEAmDNS2_Host::_leaveMulticastGroups
    */
    bool MDNSResponder::_leaveMulticastGroups()
    {
        bool bResult = false;

        for (netif* pNetIf = netif_list; pNetIf; pNetIf = pNetIf->next)
        {
            if (netif_is_up(pNetIf) && IPAddress(pNetIf->ip_addr).isSet())
            {
                bResult = true;

                // Leave multicast group(s)
#ifdef MDNS_IP4_SUPPORT
                ip_addr_t multicast_addr_V4 = DNS_MQUERY_IPV4_GROUP_INIT;
                if (ERR_OK != igmp_leavegroup_netif(pNetIf, ip_2_ip4(&multicast_addr_V4)))
                {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("\n")););
                }
#endif
#ifdef MDNS_IPV6_SUPPORT
                ip_addr_t multicast_addr_V6 = DNS_MQUERY_IPV6_GROUP_INIT;
                if (ERR_OK
                    != mld6_leavegroup_netif(
                        pNetIf, ip_2_ip6(&multicast_addr_V6) /*&(multicast_addr_V6.u_addr.ip6)*/))
                {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("\n")););
                }
#endif
            }
        }
        return bResult;
    }

}  // namespace MDNSImplementation

}  // namespace esp8266
